import streamlit as st
import time
import numpy as np
from findCd import getCdA, getTime
#  getTime(g,p,c,Height, mass_kg, Cd,Area):
# getCdA(g,p,c,CdA_init, TimeTest, Height, mass_kg, error_rate=0.01, max_iter=50, cdA_max_limit=100.0):


st.set_page_config(page_title="Find CdA", page_icon="📈")

st.markdown("# โปรแกรมหาค่าสัมประสิทธิ์แรงต้านอากาศ Find Cd A")
st.write(
    """โปรแกรมนี้เป็นโปรแกรมที่จัดทำขึ้นเพื่อ ประยุกต์ใช้คณิตศาตร์ในการหาค่า สัมประสิทธิ์แรงต้านอากาศ
    โดยใช้วิธีการแบ่งครึ่ง"""
)

#side bar

st.sidebar.header("ตั่งค่าเชิงลึก setting")
g = st.sidebar.number_input("แรงโน้มถ่วง (m/s²)",value=9.81)
p = st.sidebar.number_input("แรงดันอากาศโดยเฉลี่ย ณ พื้นที่นั้น kg/m³" , value= 1.2)
c = st.sidebar.number_input("ช่องว่างเวลาในการคำนวณ (s)", value = 0.001)
cdA_init = st.sidebar.number_input("ค่า CdA เริ่มต้นในการคำนวณ",value=1)
error_rate = st.sidebar.number_input("ค่าความผิดพลาดที่มากที่สุดที่ยอมรับได้", value = 50)
max_iter = st.sidebar.number_input("จำนวนรอบมากที่สุดที่ใช้ในการหาค่า cdA เริ่มต้น", value = 50)
max_cdA = st.sidebar.number_input("ค่า cdA มากที่สุดที่เป็นไปได้", value = 100)




mass = st.number_input("มวลของวัตถุ(g)")
height = st.number_input("ความสูง(m)")
time_test = st.number_input("เวลาที่ได้จากการทดลอง(S)")

if st.button("เริ่มการคำนวณ"):
    st.header("ผลการหาค่า CdA")
   
    if height <=0 or time_test  <= 0 or mass <= 0:
        
        st.warning(f"ไม่สามารถคำนวณได้โปรตัวสอบว่า มีค่าไดเป็น 0 หรือไม่")
    else :    
        try :
            cd_output, cd_plot = getCdA(g,p,c,cdA_init, time_test, height, mass * 1000 , error_rate , max_iter, max_cdA)
        except:
            st.warning(f"ไม่สามารถคำนวณได้โปรตัวสอบว่าใส่ค่าถูกต้องหรือไม่")
        else:
            st.write(f"ค่า Cd A ที่คำนวณได้คือ {cd_output}")
            st.line_chart(cd_plot, x_label="CdA", y_label= "Iteration")


